app/Views/exercise/latihan.php

                        </ol>
                        <h6 class="font-weight-bolder mb-0">
                            <?php
                            $query = $db->table('kategori_soal')->getWhere(['id' => $s['kategori_soal_id']]);
                            foreach ($query->getResult('array') as $q) :
---
SELECT *
FROM `kategori_soal`
WHERE `id` = '1'