app/Views/exercise/latihan-fp.php

SELECT *
FROM `kategori_soal`
WHERE `is_tp` = 1
---
                                ?>
            <h3>Account Demo</h3><hr/>
            <h5>Latihan Soal dengan Jawaban Tanpa Pembahasan</h5>
            <?php $queryClass = $db->table('kategori_soal')->getWhere(['is_tp' => 1]);

SELECT *
FROM `kategori_soal`
WHERE `is_tp` IS NULL
---
            <?php endforeach ?>
            <br/>
            <h5>Latihan Soal dengan Jawaban dan Pembahasan</h5>
            <?php $queryClass = $db->table('kategori_soal')->getWhere(['is_tp' => null]);