app/Controllers/Admin.php

SELECT *
FROM `soal`
JOIN `kategori_soal` ON `soal`.`kategori_soal_id` = `kategori_soal`.`id`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `soal`
JOIN `kategori_soal` ON `soal`.`kategori_soal_id` = `kategori_soal`.`id`
---
                    $soal = $this->soalModel->searchSoal($kategori);

                    $currentPage = $this->request->getVar('page_soal') ? $this->request->getVar('page_soal') : 1;
                    $data = [
                        'soal'  => $this->soalModel->paginate(5, 'soal'),
                        'kategori' => $this->kategoriModel->findAll(),
                        'pager' => $this->soalModel->pager,
                        'currentPage' => $currentPage
                    ];