app/Controllers/Latihan.php

INSERT INTO `latihan` (`date`, `user_id`, `created_at`, `updated_at`) VALUES ('2023-06-30 19:13:29', '2', '2023-06-30 19:13:29', '2023-06-30 19:13:29')
---

                //for dashboard exercise
                $newTime = new Time('now', 'Asia/Jakarta');
                $this->latihanModel->save([
                    'date' => $newTime,
                    'user_id' => session()->get('userID')
                ]);

UPDATE `latihan` SET `score` = 0, `benar` = 0, `salah` = 2, `updated_at` = '2023-06-30 19:13:29'
WHERE `latihan`.`id` IN (42)
---
                session()->set('latihanID', $latihanID);

                $latihanID = session()->get('latihanID');
                $this->latihanModel->save([
                    'id' => $latihanID,
                    'score' => $score,
                    'benar' => $benar,
                    'salah' => $salah
                ]);