app/Models/LatihanMDL.php

SELECT *
FROM `latihan`
WHERE `user_id` = '2'
---
    public function nilaiRatarata($id)
    {
        $this->where(['user_id' => $id]);
        $userID = $this->findAll();